#Создать текстовый файл (не программно), сохранить в нем несколько строк, выполнить подсчет количества строк, количества слов в каждой строке.
my_file = open("L5Z2.txt", "r")
content = my_file.read()
print(f"Text file content: \n {content}")
my_file = open("L5Z2.txt", "r")
content = my_file.readlines()
print(f"Number of lines in the file: {len(content)}")
my_file = open("L5Z2.txt", "r")
content = my_file.readlines()
for i in range(len(content)):
    print(f"Number of characters per line {i + 1} is {len(content[i])}")
my_file = open("L5Z2.txt", "r")
content = my_file.read()
content = content.split()
print(f"The total number of words is {len(content)}")
my_file.close()